Repository: murank/wxwidgetsjp
Catalog: wxwidgetsjp-level2.tmx
Source language: en_us
Languages: ja

source: UTF-32 is commonly used under Unix systems for internal representation of Unicode strings.
ja: 一般に、UTF-32 は Unix システムにおける Unicode 文字列の内部表現に使用されています。

source: UTF-8 uses code units of 8 bits (1 byte); code points beyond the usual english alphabet are represented using a variable number of bytes, which makes it less efficient than UTF-32 for internal representation.
ja: UTF-8 は 8 ビット (1 バイト) のコード単位を使用します; 普通のアルファベット以外のコードポイントは可変バイトで表現されるため、内部表現としては UTF-32 よりも若干効率が落ちます。

source: UTF8 encoding is more elaborated and in this example takes 7 bytes.
ja: UTF8 の符号化はより複雑で、この例では 7 バイトを消費します。

source: Under Unix systems, including Mac OS X, UCS-4 (also known as UTF-32) is used by default, however it is also possible to build wxWidgets to use UTF-8 internally by passing --enable-utf8 option to configure.
ja: Mac OS X を含む Unix システムでは、デフォルトで (UTF-32 としても知られる) UCS-4 が使用されますが、設定に --enable-utf8 オプションを渡すことで内部に UTF-8 を使用するように wxWidgets をビルドすることも可能です。

source: Under Unix, the service name may be either an integer port identifier in which case an Internet domain socket will be used for the communications or a valid file name (which shouldn't exist and will be deleted afterwards) in which case a Unix domain socket is created.
ja: Unix におけるサービス名はインターネットドメインソケットが通信に使用する整数のポート識別子か、Unix ドメインソケットが作成する有効なファイル名 (このファイルは存在してはならず、後で削除されます) のいずれかになります。

source: Under Windows 3, modal dialogs have to be emulated using modeless dialogs and a message loop.
ja: Windows 3 ではモーダルダイアログはモードレスダイアログとメッセージループを使用してエミュレートしなければなりません。

source: Under Windows, wxBitmap may load the following formats:
ja: Windows では wxBitmap は以下の形式を読み込むことができます:

source: Under Windows, wxCursor may load the following formats:
ja: Windows では wxCursor は以下の形式を読み込むことができます:

source: Under Windows, wxIcon may load the following formats:
ja: Windows では wxIcon は以下の形式を読み込むことができます:

source: Under certain circumstances, it will be required to define your own event class e.g. for sending more complex data from one place to another.
ja: (より複雑なデータをある場所から別の場所へ送るといった) 特定の状況下では独自のイベントクラスの定義が必要になるでしょう。

source: Under certain circumstances, you must define your own event class e.g., for sending more complex data from one place to another.
ja: (より複雑なデータをある場所から別の場所へ送るといった) 特定の状況下では独自のイベントクラスを定義する必要があります。

source: Under wxGTK, wxBitmap may load the following formats:
ja: wxGTK では wxBitmap は以下の形式を読み込むことができます:

source: Under wxGTK, wxCursor may load the following formats (in addition to stock cursors):
ja: wxGTK では wxCursor は (既存のカーソルに加えて) 以下の形式を読み込むことができます:

source: Under wxGTK, wxIcon may load the following formats:
ja: wxGTK では wxIcon は以下の形式を読み込むことができます:

source: Under wxGTK, wxCursor may load the following formats (in additional to stock cursors):
ja: wxGTK では wxCursor は (既存のカーソルに加えて) 以下の形式を読み込むことができます:

source: Under wxMotif and wxX11, wxBitmap may load the following formats:
ja: wxMotif と wxX11 では wxBitmap は以下の形式を読み込むことができます:

source: Under wxMotif and wxX11, wxCursor may load the following formats:
ja: wxMotif と wxX11 では wxCursor は以下の形式を読み込むことができます:

source: Under wxMotif and wxX11, wxIcon may load the following formats:
ja: wxMotif と wxX11 では wxImage は以下の形式を読み込むことができます:

source: Unfortunately many languages use different charsets under Unix and Windows (and other platforms, to make the situation even more complicated).
ja: 残念なことに、Unix や Windows では多くの言語で異なる文字コードが使用されています。(そして、他のプラットフォームではさらに複雑なことになっています)

source: Unfortunately, some of them have rather counter-intuitive behaviour (like strncpy() which doesn't always terminate the resulting string with a NULL) and are in general not very safe (passing NULL to them will probably lead to program crash).
ja: 残念なことに、いくつかの関数は直感的でない振る舞いをします (例えば strncpy() は結果の文字列を常に NULL で終端させるとは限りません) し、一般的にあまり安全ではありません。（それらの関数に NULL を渡すとおそらくプログラムがクラッシュするでしょう)

source: Unicode Related Preprocessor Symbols
ja: Unicode 関連のプリプロセッサシンボル

source: Unicode Representations and Terminology
ja: Unicode の表現方法と用語

source: Unicode Support in wxWidgets
ja: wxWidgets における Unicode 対応

source: Unicode and the Outside World
ja: Unicode と外部の世界

source: Unicode assigns each character of almost any existing alphabet/script a number, which is called code point; it's typically indicated in documentation manuals and in the Unicode website as U+xxxx where xxxx is an hexadecimal number.
ja: Unicode では、存在するほぼすべての文字を コードポイント と呼ばれる番号に割り当てています; 一般的に、マニュアルや Unicode のウェブサイトでは U+xxxx (xxxx は 16 進数です) という形で表現されます。

source: Unicode is Always Used by Default
ja: デフォルトで Unicode が常に使用されます

source: Unicode is a standard for character encoding which addresses the shortcomings of the previous standards (e.g. the ASCII standard), by using 8, 16 or 32 bits for encoding each character.
ja: Unicode とは、 1 文字あたり 8、 16、 32 ビットを使用することで、これまでの標準的な文字コード (例えば ASCII) の欠点に対処した文字コードの標準規格のことです。

source: Unicode is a standard for character encoding which addresses the shortcomings of the previous, 8 bit standards, by using at least 16 (and possibly 32) bits for encoding each character.
ja: Unicode とは、 1 文字あたり少なくとも 16 (あるいは 32) ビットを使用することで、これまでの標準的な 8 ビットの文字コードの欠点に対処した文字コードの標準規格のことです。

source: Unicode-Related Compilation Errors
ja: Unicode 関連のコンパイルエラー

source: Unicode-related Changes
ja: Unicode に関連する変更

source: Unlike for all the other logging functions, this function can't be overridden by a log target.
ja: 他のすべてのロギング関数と異なり、この関数はログターゲットによってオーバーライドすることができません。

source: Unlike in earlier versions of wxWidgets, OnInit does not return a frame.
ja: wxWidgets の初期バージョンとは違い、OnInit はフレームを返却しません。

source: Unlike the original wxWidgets Dialog Editor, editors such as wxDesigner, DialogBlocks, XRCed and wxWorkshop create dialogs based exclusively on sizers, practically forcing the user to create platform independent layouts without compromises.
ja: wxWidgets のオリジナルのダイアログエディタと異なり、wxDesigner、DialogBlocks、XRCed、wxWorkshop などのエディタはもっぱらサイザーのみに基づいてダイアログを作成し、事実上、プラットフォーム非依存のレイアウトを妥協なしに作ることをユーザに強制します。

source: Usage is simple.
ja: 使用方法は単純です。

source: Use wxNotebook::ChangeSelection instead, as wxNotebook::SetSelection is deprecated
ja: wxNotebook::SetSelection は非推奨のため、代わりに wxNotebook::ChangeSelection を使用してください。

source: Use wxString instead of C style strings.
ja: C 形式の文字列の代わりに wxString を使用する

source: Use PushEventHandler/PopEventHandler to form a chain of event handlers, where each handler processes a different range of events independently from the other handlers.
ja: 他のイベントハンドラとは異なる範囲のイベントを独立して処理するようなイベントハンドラを作成する場合に PushEventHandler/PopEventHandler を使用してください。

source: Use of this function for windows which are not toplevel windows (such as wxDialog or wxFrame) is disc...
ja: (wxDialog や wxFrame といった) トップレベルウィンドウでないウィンドウに対してこの関数を使用することは推奨されていません。

source: Use the wxConnection member functions to send messages to the server.
ja: サーバへメッセージを送信するには wxConnection のメンバ関数を使用してください。

source: Use this macro in a source file to end listing static event handlers for a specific class...
ja: 静的イベントハンドラの列挙を終了するために、ソースファイル内でこのマクロを使用してください。

source: Use this macro in a source file to start listing static event handlers for a specific class...
ja: 静的イベントハンドラの列挙を開始するために、ソースファイル内でこのマクロを使用してください。

source: Use this macro inside a class declaration to declare a static event table for that class...
ja: 静的イベントテーブルを宣言するために、クラス宣言の中でこのマクロを使用してください。

source: Use this to paint on the client area of a window, but only from within a wxPaintEvent.
ja: ウィンドウのクライアントエリアに描画するときに使用しますが、wxPaintEvent の中で のみ 使用してください。

source: Use this to paint on the client area of window (the part without borders and other decorations), but do not use it from within an wxPaintEvent.
ja: ウィンドウのクライアントエリア (ボーダーや他の装飾を除いた部分) に描画するときに使用します。ただし、wxPaintEvent の中で使用しないでください。

source: Use this to paint on the screen, as opposed to an individual window.
ja: 個別のウィンドウではなく、スクリーン上に描画するときに使用します。

source: Use this to paint on the whole area of a window, including decorations.
ja: 装飾を含む、ウィンドウ全体に描画するときに使用します。

source: Used for special cursor processing based on current mouse position
ja: 現在のマウス位置に基づいた特殊なカーソル処理に使用される

source: Used to query layout information
ja: レイアウト情報の問い合わせに使用される

source: User Calls to Exit From a Menu
ja: 終了メニューのユーザ呼び出し

source: User Generated Events vs Programmatically Generated Events
ja: ユーザ生成イベント vs プログラム生成イベント

source: Using Existing Event Classes
ja: 既存のイベントクラスの使用

source: Using a cast to force the issue (listed only for completeness):
ja: 型を決定させるためのキャスト (これはリストの網羅性のために上げているだけです):

source: Using an explicit conversion to narrow, multibyte, string:
ja: ナロー (マルチバイト) 文字列への明示的な変換:

source: Using existing event classes
ja: 既存のイベントクラスの使用

source: Using preconstructed wxCSConv instance.
ja: 事前に構築した wxCSConv インスタンスを使用する。

source: Using these target all the log messages can be redirected to a text control.
ja: これらのターゲットを使用してログメッセージをテキストコントロールへリダイレクトできます。

source: Using trace masks
ja: トレースマスクの使用

source: Using wxString to store binary data
ja: wxString を使用したバイナリデータの格納

source: Usually there is no next event handler so the control passes to the next step but see Event Handlers Chain for how the next handler may be defined.
ja: 普通は次のイベントハンドラが存在しないため、次のステップを行いますが、次のイベントハンドラを定義する方法は イベントハンドラの連鎖 を参照してください。

source: Usually this doesn't matter much because most algorithms used on the strings examine them sequentially anyhow and because wxString implements a cache for iterating over the string by index but it can have serious consequences for algorithms using random access to string elements as they typically acquire O(N^2) time complexity instead of O(N) where N is the length of the string.
ja: 大半のアルゴリズムでは文字列を逐次的に調べますし、wxString は文字列にインデックスでアクセスするためのキャッシュを持つため、通常はこのことがそれほど問題になることはありません。しかし、文字列にランダムアクセスするアルゴリズムにとっては、一般的に計算時間が O(N) から O(N^2) になる (N は文字列長です) ため、深刻な影響があります。

source: Usually you don't need to worry about this as the conversions do their work behind the scenes however in some cases it doesn't work.
ja: これらの変換は裏側で行われるため、通常はこのことを気にする必要はありませんが、いくつかの場合ではうまく動作しないことがあります。

source: Validates the current values of the child controls using their validators.
ja: バリデータを使用して子コントロールの現在の値を検証します。

source: Validation of data in controls is covered in Validator overview.
ja: コントロールのバリデーションは バリデータの概要 で触れています。

source: Validation of data in controls is covered in wxValidator Overview.
ja: コントロールのバリデーションは wxValidator の概要 で触れています。

source: Validator basic concepts
ja: バリデータの基本的な概念

source: Validator for text entries used for floating point numbers entry.
ja: 浮動小数点を入力するテキスト項目に使用するバリデータ。

source: Validator for text entries used for integer entry.
ja: 整数を入力するテキスト項目に使用するバリデータ。

source: Watch out to put in enough casts to the inherited event function.
ja: 継承したイベント関数へのキャストが必要なことも忘れないでください。

source: We believe the new behaviour corresponds better to user expectations but if you did rely on the old behaviour you will have to update your code to set the minimal sizes of the sizer items to be in the same proportion as the items proportions to return to the old behaviour.
ja: この新しい振る舞いはユーザの予想により一致するものだと信じていますが、以前の振る舞いに依存している場合、コントロールのプロポーションと同じ比率でコントロールの最小サイズを設定するようにコードを更新する必要があります。

source: We can take the example of wxFileInputStream and here is some sample code:
ja: 例として wxFileInputStream のサンプルコードを以下に示します:

source: We have a wxChar type which maps either on char or wchar_t depending on the mode in which program is being compiled.
ja: wxChar 型はコンパイル時のモードによって char か wchar_t のいずれかにマッピングされます。

source: We have seen that it was easy to write Unicode programs using wxWidgets types and macros, but it has been also mentioned that it isn't quite enough.
ja: すでに見てきたように、wxWidgets の型とマクロを使用することで簡単に Unicode プログラムを書くことができます。しかし、それで十分ではないことについても述べてきました。.

source: What about other kinds of window?
ja: 他の種類のウィンドウについてはどうでしょう?

source: What happens here?
ja: ここでは何が起きているのでしょうか?

source: What is the default behaviour?
ja: デフォルトの振る舞いどのようなものですか?

source: What is the sequence of events in a window deletion?
ja: ウィンドウ削除時に発生する一連のイベントにはどのようなものがありますか?

source: What makes sizers so well fitted for use in wxWidgets is the fact that every control reports its own minimal size and the algorithm can handle differences in font sizes or different window (dialog item) sizes on different platforms without problems.
ja: サイザーが wxWidgets に非常に適している理由は、すべてのコントロールが自身の最小サイズを通知し、このアルゴリズムが異なるプラットフォームのフォントサイズやウィンドウ (ダイアログのアイテム) のサイズの違いを問題なく取り扱うことができるためです。

source: What should I do to upgrade my 1.xx OnClose to 2.0?
ja: 1.xx の OnClose を 2.0 にアップグレードするには何をすべきですか?

source: What should I do when the user calls up Exit from a menu?
ja: ユーザがメニューから終了を選んだときに何をすべきですか?

source: When a wxDialog::Show is called (for a modeless dialog) or wxDialog::ShowModal is called (for a modal dialog), the function wxWindow::InitDialog is automatically called.
ja: wxDialog::Show (モードレスダイアログ用) または wxDialog::ShowModal (モーダルダイアログ用) が呼ばれると自動的に wxWindow::InitDialog が呼ばれます。

source: When a character is input, wxTextValidator checks the character against the allowed filter flag (wxFILTER_ALPHA in this case).
ja: 文字が入力されたときに wxTextValidator はその文字がフィルタフラグ (この場合は wxFILTER_ALPHA) に合致するか確認します。

source: When an event is received from the windowing system, wxWidgets calls wxEvtHandler::ProcessEvent() on the first event handler object belonging to the window generating the event.
ja: ウィンドウからイベントを受信したとき、wxWidgets はイベントを生成したウィンドウに属する最初のイベントハンドラオブジェクトの wxEvtHandler::ProcessEvent を呼び出します。

source: When an event is received from the windowing system, wxWidgets calls wxEvtHandler::ProcessEvent on the first event handler object belonging to the window generating the event.
ja: ウィンドウからイベントを受信したとき、wxWidgets はイベントを生成したウィンドウに属する最初のイベントハンドラオブジェクトの wxEvtHandler::ProcessEvent を呼び出します。

source: When appropriate, create a new connection using wxClient::MakeConnection, with arguments host name (processed in Unix only, use 'localhost' for local computer), service name, and topic name for this connection.
ja: 適切なときにホスト名 (Unix の場合のみ使用されます。ローカルコンピュータを指定する場合は 'localhost' を使用してください)、サービス名、この接続用のトピック名を指定して wxClient::MakeConnection を呼び出し、新しいコネクションを作成する。

source: When controls get more complicated, more specific wxCommandEvent-derived event classes providing additional control-specific information can be used, such as wxTreeEvent for events from wxTreeCtrl windows.
ja: より複雑なコントロールのときには、コントロール独自の追加情報を提供する、wxCommandEvent を継承したより具体的なイベントクラスを使用できます。例えば、wxTreeCtrl ウィンドウから送られるイベントでは wxTreeEvent が使用できます。

source: When controls get more complicated, then specific event classes are used, such as wxTreeEvent for events from wxTreeCtrl windows.
ja: より複雑なコントロールのときには特定のイベントクラスが使用されます。例えば、wxTreeCtrl から発生するイベントには wxTreeEvent が使用されます。

source: When instead wxUSE_UNICODE_UTF8==1 (e.g. on Linux and Mac OS X) wxString handles UTF8 multi-bytes sequences just fine also for characters outside the BMP (it implements per code point indexing), so that you can use UTF8 in a completely transparent way:
ja: 代わりに wxUSE_UNICODE_UTF8==1 (例えば、Linux、Mac OS X) とした場合、wxString は BMP 以外の文字でも (コードポイントごとのインデックス として実装されているため) UTF8 マルチバイトシーケンスとして扱います。そのため、完全に透過的な方法で UTF8 を使用することができます。

source: When the client application starts, it must create an instance of the derived wxClient.
ja: クライアントアプリケーションを実行するときには wxClient の継承クラスのインスタンスを作成する必要があります。

source: When the fitting size for the given contents is computed, it will usually be the client size and the size of the borders needs to be added to obtain the full best size.
ja: 指定された内容物にフィットするサイズが計算されると、通常はそれがクライアントサイズになり、それにボーダーのサイズを加えることで全体の最適サイズを取得します。

source: When the mouse moves in a window of a program which understands the same drag-and-drop protocol (any program under Windows or any program supporting the XDnD protocol under X Windows), the corresponding wxDropTarget methods are called - see below.
ja: 同じ ドラッグ・アンド・ドロップ プロトコルを解釈するプログラム (Windows の任意のプログラム、もしくは X ウィンドウの XDnD プロトコルに対応しているプログラム) のウィンドウ内へマウスが入ると、対応する wxDropTarget 関数が呼ばれます。以下を参照してください。

source: When the user clicks on a button, for example the OK button, the application should first call wxWindow::Validate, which returns false if any of the child window validators failed to validate the window data.
ja: OK ボタンなど、ユーザがボタンを押下すると最初に wxWindow::Validate が呼ばれます。この関数は子ウィンドウのいずれかでウィンドウデータの検証に失敗した場合に false を返却します。

source: When the user clicks on the system close button or system close command, in a frame or a dialog, wxWidgets calls wxWindow::Close.
ja: ユーザがフレームやダイアログの閉じるボタンを押下したときや、終了コマンドを実行したときに wxWidgets は wxWindow::Close を呼び出します。

source: When to use multiple threads
ja: マルチスレッドをいつ使用するべきか

source: When using a vertical sizer, each child can be centered, aligned to the right or aligned to the left.
ja: 垂直方向のサイザーを使用する場合、各子コントロールを中央寄せ、右寄せ、左寄せにすることが可能です。

source: When working with Unicode, it's important to define the meaning of some terms.
ja: Unicode を使用するときは、いくつかの言葉を定義しておくことが重要です。

source: When writing a multi-threaded application, it is strongly recommended that no secondary threads call GUI functions.
ja: マルチスレッドアプリケーションを作成するときには サブスレッドから GUI 関数を呼び出さない ことを強く推奨します。

source: When wxGROW flag is not used, the item can be aligned within available space.
ja: wxGROW フラグを使用しない場合、コントロールを利用可能なスペース内で整列させることができます。

source: When you tell the wxLocale class to load a message catalog that contains a correct header, it checks the charset.
ja: 正しいヘッダを含むメッセージカタログを読み込むように wxLocale クラスへ指示すると、そこで文字コードのチェックが行われます。

source: While generically wxEvents can be generated both by user actions (e.g. resize of a wxWindow) and by calls to functions (e.g. wxWindow::SetSize), wxWidgets controls normally send wxCommandEvent-derived events only for the user-generated events.
ja: 一般的に wxEvents はユーザ操作 (wxWindow のリサイズなど) と関数呼び出し (wxWindow::SetSize など) のどちらからでも発生しますが、wxCommandEvent を継承したイベントはユーザが操作した場合のみ、wxWidgets コントロールから送信されます。

source: While generically wxEvents can be generated both by user actions (e.g., resize of a wxWindow) and by calls to functions (e.g., wxWindow::SetSize), wxWidgets controls normally send wxCommandEvent-derived events only for the user-generated events.
ja: 一般的に wxEvents はユーザ操作 (wxWindow のリサイズなど) と関数呼び出し (wxWindow::SetSize など) のどちらからでも発生しますが、wxCommandEvent を継承したイベントはユーザが操作した場合のみ、wxWidgets コントロールから送信されます。

source: Window Deletion
ja: ウィンドウの削除

source: Window Identifiers
ja: ウィンドウ識別子

source: Window Sizing Overview
ja: ウィンドウサイズの概要

source: Window Styles
ja: ウィンドウスタイル

source: Window deletion can be a confusing subject, so this overview is provided to help make it clear when and how you delete windows, or respond to user requests to close windows.
ja: ウィンドウの削除は混乱しやすいテーマなので、この概要ではいつ、どのようにウィンドウを削除するか、もしくはユーザの要求に応じてウィンドウを閉じるかについて、理解の手助けになる情報を提供します。

source: Window identifiers are integers, and are used to uniquely determine window identity in the event system (though you can use it for other purposes).
ja: ウィンドウ識別子とは、イベントシステムにおいてウィンドウを一意に識別するための整数値です。 (とはいえ、他の用途に使用することもできます)

source: Window styles are used to specify alternative behaviour and appearances for windows, when they are created.
ja: ウィンドウスタイルはウィンドウの作成時に別の振る舞いや見た目を指定するために使用されます。

source: Windows bitmap file (wxBITMAP_TYPE_BMP)
ja: Windows ビットマップファイル (wxBITMAP_TYPE_BMP)

source: Windows bitmap resource (wxBITMAP_TYPE_BMP_RESOURCE)
ja: Windows ビットマップリソース (wxBITMAP_TYPE_BMP_RESOURCE)

source: Windows cursor file (wxBITMAP_TYPE_CUR)
ja: Windows カーソルファイル (wxBITMAP_TYPE_CUR)

source: Windows cursor resource (wxBITMAP_TYPE_CUR_RESOURCE)
ja: Windows カーソルリソース (wxBITMAP_TYPE_CUR_RESOURCE)

source: Windows icon file (wxBITMAP_TYPE_ICO)
ja: Windows アイコンファイル (wxBITMAP_TYPE_ICO)

source: Windows icon resource (wxBITMAP_TYPE_ICO_RESOURCE)
ja: Windows アイコンリソース (wxBITMAP_TYPE_ICO_RESOURCE)

source: Windows with parents, such as controls, don't have delayed destruction and don't usually have close event handlers, though you can implement them if you wish.
ja: コントロールなど、親を持つウィンドウは直ちに削除され、通常は終了イベントハンドラを持ちません。とはいえ、必要であればそれらを実装することができます。

source: Windows-specific data types could also be used on the PC.
ja: また、Windows 独自のデータ型を使用することもできます。

source: With Bind<>() they simply won't be called if it wasn't correctly initialized.
ja: Bind<>() を使用することで、初期化が正常に行われなかった場合は単純にイベントハンドラが呼び出されないだけになります。

source: With adaptation enabled, if the display size is too small for the dialog, wxWidgets (or rather the standard adapter class wxStandardDialogLayoutAdapter) will make part of the dialog scrolling, leaving standard buttons in a non-scrolling part at the bottom of the dialog.
ja: 適応を有効にすると、ダイアログを表示するのに画面サイズが小さすぎる場合に wxWidgets (と言うより標準の適応クラスである wxStandardDialogLayoutAdapter) が標準ボタンをダイアログ下部の非スクロール領域に残してダイアログの一部をスクロールするようにします。

source: With the aid of boost::bind<>() you can even use methods or functions which don't quite have the correct signature:
ja: boost::bind<>() のおかげで、シグネチャが完全に一致しないメンバ関数でも使用することができます:

source: With the event handlers, you only have the option of pre-processing the events and in order to still let the default behaviour happen you must call wxEvent::Skip() and not call the base class event handler directly.
ja: イベントハンドラでは選択肢は事前処理だけで、デフォルトの振る舞いを呼び出すためには wxEvent::Skip() を呼ぶ必要があり、基底クラスのイベントハンドラを直接呼び出しては いけません 。

source: With the virtual functions, you need to call the base class function directly and you can do it either in the beginning of the derived class handler function (to post-process the event) or at its end (to pre-process the event).
ja: 仮想関数では基底クラスの関数を直接呼び出す必要があり、継承クラスのイベントハンドラの最初 (イベントの事後処理を行なう場合) か最後 (イベントの事前処理を行なう場合) で呼ぶことができます。

source: Within wxDesigner, this stretch factor gets set from the Option menu.
ja: wxDesigner では、ストレッチ係数は Option メニューから指定できます。

source: Works like Yield() with onlyIfNeeded == true, except that it allows the caller to specify a mask of t...
ja: onlyIfNeeded == true の場合の Yield() と同じように動作しますが、呼び出し元が wxEventCategory の値のマスクを指定できる点が異なります。このマスクではどのイベントを処理するか、もしくは "遅延させる" かを指定します。

source: Write data to the file (descriptor).
ja: ファイル (ディスクリプタ) へデータを書き込みます。

source: Write your in-code messages in English or without diacritics and put real messages into the message catalog (see Internationalization).
ja: コード中のメッセージは英語か、もしくは発音区別符号を使用せずに書き、実際のメッセージはメッセージカタログ (国際化 参照) に書くようにしてください。

source: Writeable reference to a character in wxString.
ja: wxString 内の文字列の書き込み可能な参照です。

source: Writes the text into the text control at the current insertion position.
ja: テキストコントロールの現在の挿入位置へテキストを書き込みます。

source: Writing
ja: 次のように書くと

source: Writing Non-English Applications
ja: 非英語アプリケーションの作成

source: Writing an image format handler for wxImage is also far easier than writing one for wxBitmap, because wxImage has exactly one format on all platforms whereas wxBitmap can store pixel data very differently, depending on colour depths and platform.
ja: また、wxImage 用の画像形式ハンドラは wxBitmap のものより簡単に書くことができます。なぜなら、wxImage はすべてのプラットフォームでただひとつの形式を使用するのに対し、wxBitmap は色深度やプラットフォームに応じて様々な形式でピクセルデータを格納できるためです。

source: Writing internationalized programs is much easier with Unicode and, as the support for it improves, it should become more and more so.
ja: Unicode を使うことで、国際化対応のプログラムをより簡単に書くことができます。そして、 Unicode 対応が進むにつれ、それはますます簡単になっていくことでしょう。

source: XBM data and file (wxBITMAP_TYPE_XBM)
ja: XBM データおよび XBM ファイル (wxBITMAP_TYPE_XBM)

source: XPM data and file (wxBITMAP_TYPE_XPM)
ja: XPM データおよび XPM ファイル (wxBITMAP_TYPE_XPM)

source: Yes, child windows are deleted from within the parent destructor.
ja: はい、子ウィンドウは親ウィンドウのデストラクタで削除されます。

source: You also don't need to use wxChar any longer but can directly use the standard wchar_t type even if, again, wxChar continues to work.
ja: また、wxChar ももはや使用する必要がありません。ただし、繰り返しますが、標準の wchar_t を直接使用できるとはいえ、wxChar は引き続き動作します。

source: You also need to insert a macro
ja: また、以下のマクロを

source: You call wxApp::SetTopWindow to let wxWidgets know about the top window.
ja: wxWidgets へトップウィンドウを教えるためには wxApp::SetTopWindow を使用します。
